app/controllers/accounts_controller.rb

  def create
    @account = Account.new(params[:account])
    @account.balance = params[:account][:balance].gsub(/\$|\,/){''}
    @account.user_id = @user.id
    if request.post? && @account.save
---
INSERT INTO "accounts" ("name", "created_at", "institution", "updated_at", "account_type", "user_id", "balance") VALUES('UPLECU Checking', '2009-07-29 02:56:25', 'UPLECU', '2009-07-29 02:56:25', 'Checking', 1, 3500.0)