app/controllers/buckets_controller.rb

SELECT * FROM "accounts" WHERE ("accounts".user_id = 1)
SELECT * FROM "paychecks" WHERE ("paychecks".user_id = 1)
SELECT * FROM "buckets" WHERE (bucket_type != 'debt' and account_id = 1)
---
  def index
    @values = Hash.new
    @user.accounts.each do |account|
      @user.paychecks.each do |paycheck|
        account.regular_buckets.each do |bucket|