app/controllers/paychecks_controller.rb

  def create
    parms = params[:paycheck]
    parms[:amount] = parms[:amount].gsub(/\$|\,/){''}
    parms[:user_id] = @user.id
    @paycheck = Paycheck.new(parms)
    if @paycheck.save
---
INSERT INTO "paychecks" ("name", "created_at", "updated_at", "amount", "user_id") VALUES('First of Month', '2009-07-29 02:56:54', '2009-07-29 02:56:54', 2350.0, 1)

  def edit
    @paycheck = Paycheck.find(params[:id])
---
SELECT * FROM "paychecks" WHERE ("paychecks"."id" = 1)

  def update
    @paycheck = Paycheck.find(params[:id])
    @paycheck.amount = params[:paycheck][:amount].gsub(/\$|\,/){''}
    @paycheck.name = params[:paycheck][:name]
    @paycheck.paycheck_to_account_attributes = params[:paycheck][:paycheck_to_account_attributes]
    if @paycheck.save
---
SELECT * FROM "paychecks" WHERE ("paychecks"."id" = 1)
UPDATE "paycheck_to_accounts" SET "updated_at" = '2009-07-29 03:00:11', "amount" = 1350.0 WHERE "id" = 1
UPDATE "paychecks" SET "updated_at" = '2009-07-29 03:00:11', "amount" = 1350.0 WHERE "id" = 1